{
    "entry_point": "jobshop_intensity_problem:JobShopIntensityProblem",
    "default_params": {
      "instance_file": "instances/i01_ft06.txt"
    },
    "problem_type": "Job Shop Scheduling with Intensity",
    "description": "In the job shop scheduling problem with intensity, a set of jobs must be processed on every machine of the shop. Each job consists of an ordered sequence of tasks (activities), one per machine. Each task has a given processing time; however, the progress of a task depends on the machine's intensity over time – an intensity of 0 means the machine is off, and at each time step, an ongoing task's progress increases by the machine's current intensity. A task is complete when the cumulative intensity since its start reaches its processing time. Tasks in a job must follow a specified processing order, and each machine processes tasks in a sequence defined by the candidate solution. The objective is to minimize the makespan, i.e. the time when all jobs have been processed.",
    "keywords": [
      "job shop",
      "scheduling",
      "intensity",
      "dynamic processing",
      "makespan"
    ],
    "data_format": {
      "instance_file": {
        "format": "A text file containing: first line with three integers: number of jobs, number of machines, and time horizon; for each job, a line with the processing times on each machine (given in processing order); for each job, a subsequent line with the processing order (an ordered list of visited machines, given as 1-indexed); for each machine, a line with its intensity values for each time step (the number of time steps equals the time horizon)."
      }
    },
    "decision_variables": {
      "jobs_order": {
        "type": "list of lists of int",
        "description": "A list (of length equal to the number of machines) where each element is a permutation of job indices (0-indexed) representing the processing sequence on that machine."
      }
    },
    "objective": {
      "type": "minimization",
      "function": "Makespan = max_{j in jobs} (finish time of the last task of job j)",
      "description": "Minimize the makespan, defined as the maximum completion time among all jobs, where each job's tasks must be processed in its specified order and the progress of each task is governed by the machine's time-varying intensity."
    },
    "solution_representation": "A dictionary with key 'jobs_order' mapping to a list of job sequences (one per machine).",
    "compatible_optimizers": [
      "genetic_algorithm",
      "simulated_annealing",
      "particle_swarm",
      "tabu_search"
    ]
  }
  